# Задача 1
# Строка представляет собой арифметическое выражение из однозначных чисел и знаков + и -
# Вычислите результат.

# n = (8-5+2-1)
# print(n)

# Задача 2
# Словом в данной задаче считается последовательность букв,
# ограниченная пробелами или началом или концом строки.
# Выведите все слова из строки в столбик. НЕЛЬЗЯ ПОЛЬЗОВАТЬСЯ МЕТОДАМИ СТРОК (split)

# sentence = 'Hello world'
# word = ""
# for w in sentence:
#     if w.isalpha():
#         word = word + w
#     elif not w.isalpha():
#         print(word)
#         word = ""
# print(word)
