# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# N = int(input("Введите размер массива: "))
# A = list(range(1, N+1))
# X = int(input("Введиет чило X: "))
# count = 0
# for i in range(N):
#     if A[i] == X:
#         count += 1
# print(A)
# print(f'Число {X} встречается в списке {count} раз')


# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

#  N = int(input("Введите размер массива: "))
# A = list(range(1, N+1))
# X = int(input("Введиет чило X: "))
# min = A[0]
# for i in range(1, N):
#     if X > N:
#         min = X-1
#     else: min = X+1
# print(f"Самый близкий по величине элемент к заданному числу {X} -> {min}.")
